Hebaiju/esp8266_opendoor/src/service/srv_web.cpp
#include "srv_web.h"
#include "../common/log.h"
#include "../common/config.h"
#include "../driver/drv_led.h"
#include "srv_wifi.h"
#include "srv_ir_ac.h"
#include "srv_ntp.h"
#include "srv_blinker.h"
#include "../app_task/task_headers.h"
#include <ESP8266WebServer.h>
#include <DNSServer.h>
#include <EEPROM.h>

static ESP8266WebServer s_server(80);
static DNSServer s_dns_server;
static bool s_web_started = false;
static uint32_t s_request_count = 0;

/* ===== HTML页面 (PROGMEM) — 工业控制台风 · 合并状态 · 弹窗配置 ===== */
static const char AP_PANEL_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1.0,maximum-scale=1.0,user-scalable=no">
<title>开门猫 - 控制台</title>
<style>
*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}
html,body{height:100%;width:100%}
body{font-family:-apple-system,BlinkMacSystemFont,"Segoe UI",Roboto,"Helvetica Neue",Arial,sans-serif;
color:#c8c8c8;min-height:100vh;background:#141414;
background-image:
  linear-gradient(rgba(255,255,255,.015) 1px,transparent 1px),
  linear-gradient(90deg,rgba(255,255,255,.015) 1px,transparent 1px);
background-size:24px 24px}
.wrap{max-width:480px;margin:0 auto;padding:12px 12px 48px}
.hdr{border-bottom:1px solid #252525;padding:6px 0 14px;margin-bottom:14px}
.hdr h1{font-size:18px;font-weight:700;color:#fff;letter-spacing:2px;text-transform:uppercase}
.hdr .sub{font-size:10px;color:#555;margin-top:4px;letter-spacing:1px}
.card{background:#1a1a1a;border:1px solid #242424;border-radius:3px;margin-bottom:10px}
.card-hd{display:flex;align-items:center;justify-content:space-between;
padding:8px 12px;border-bottom:1px solid #222;background:#1e1e1e}
.card-hd .t{font-size:10px;font-weight:600;color:#888;letter-spacing:1px;text-transform:uppercase}
.card-hd .s{font-size:9px;color:#444;font-family:Consolas,monospace}
.card-bd{padding:10px 12px}

/* 状态行 */
.st-row{display:flex;gap:6px;margin-bottom:12px;flex-wrap:wrap}
.st-tag{display:inline-flex;align-items:center;gap:5px;
background:#1c1c1c;border:1px solid #2a2a2a;border-radius:2px;
padding:4px 8px;font-size:10px;color:#777;font-family:Consolas,Monaco,monospace;cursor:pointer;transition:border-color .15s}
.st-tag:hover{border-color:#ff6b35}
.st-tag .led{width:6px;height:6px;border-radius:1px;background:#444}
.st-tag.ok .led{background:#3bca3b;box-shadow:0 0 5px #3bca3b}
.st-tag.err .led{background:#e53e3e;box-shadow:0 0 5px #e53e3e}
.st-tag.warn .led{background:#e58a00;box-shadow:0 0 5px #e58a00}

/* 系统状态网格 */
.grid{display:grid;grid-template-columns:repeat(4,1fr);gap:8px}
.cell{background:#141414;border:1px solid #222;border-radius:2px;padding:8px 6px;text-align:center;cursor:pointer;transition:border-color .15s}
.cell:active{border-color:#ff6b35}
.cell .v{font-size:14px;font-weight:600;color:#fff;font-family:Consolas,monospace}
.cell .l{font-size:9px;color:#555;margin-top:3px;text-transform:uppercase;letter-spacing:.5px}
.cell.highlight{border-color:#ff6b35;background:rgba(255,107,53,.05)}
.cell.highlight .v{color:#ff6b35}

/* 门控制 - 含指示灯在右下角 */
.door-wrap{position:relative;text-align:center;padding:20px 0 16px}
.door-btn{width:130px;height:130px;border:2px solid #333;border-radius:4px;cursor:pointer;
font-size:42px;color:#fff;background:#1e1e1e;
box-shadow:0 4px 0 #0a0a0a,inset 0 1px 0 rgba(255,255,255,.03);
display:inline-flex;align-items:center;justify-content:center;
outline:none;-webkit-user-select:none;user-select:none;
-webkit-appearance:none;appearance:none;transition:all .1s;position:relative}
.door-btn:active{transform:translateY(3px);box-shadow:0 1px 0 #0a0a0a}
.door-btn .ic{display:inline-block;transition:transform .15s}
.door-btn.work{background:linear-gradient(180deg,#ff7b47 0%,#d94f15 100%);border-color:#ff6b35;
box-shadow:0 4px 0 #8a3410,inset 0 1px 0 rgba(255,255,255,.12)}
.door-btn.work:active{transform:translateY(3px);box-shadow:0 1px 0 #8a3410}
.door-btn.work .ic{animation:shake .35s ease-in-out infinite}
@keyframes shake{0%,100%{transform:rotate(0)}25%{transform:rotate(-4deg)}75%{transform:rotate(4deg)}}
.door-tx{margin-top:10px;font-size:11px;color:#666;font-weight:500}
.door-msg{margin-top:4px;font-size:10px;color:#444;font-family:Consolas,monospace;min-height:14px}
.door-msg.ok{color:#3bca3b}
.door-msg.fail{color:#e53e3e}

/* 指示灯在门控框右下角 */
.light-ctrl{position:absolute;bottom:16px;right:16px;display:flex;align-items:center;gap:6px}
.light-ctrl .ic{font-size:16px;opacity:.7}
.light-tgl{width:34px;height:18px;border:1px solid #2a2a2a;border-radius:2px;background:#141414;
cursor:pointer;position:relative;outline:none;-webkit-appearance:none;appearance:none;transition:all .15s}
.light-tgl::after{content:'';position:absolute;top:2px;left:2px;
width:10px;height:10px;border-radius:1px;background:#555;transition:all .15s}
.light-tgl.on{background:#0f2a0f;border-color:#1f5a1f}
.light-tgl.on::after{left:20px;background:#3bca3b}

/* 折叠面板 */
.collapse-hd{display:flex;align-items:center;justify-content:space-between;
padding:8px 12px;cursor:pointer;background:#1e1e1e;border-bottom:1px solid #222;
user-select:none;-webkit-user-select:none}
.collapse-hd .l{font-size:10px;font-weight:600;color:#888;letter-spacing:1px;text-transform:uppercase}
.collapse-hd .a{font-size:9px;color:#555;transition:transform .2s}
.collapse-hd.open .a{transform:rotate(180deg)}
.collapse-bd{max-height:0;overflow:hidden;transition:max-height .3s ease}
.collapse-bd.open{max-height:800px}
.collapse-in{padding:10px 12px}

/* 空调控制 */
.ac-ctrl{display:grid;grid-template-columns:repeat(3,1fr);gap:6px;margin-bottom:10px}
.ac-btn{background:#141414;border:1px solid #2a2a2a;border-radius:2px;
padding:8px 4px;font-size:10px;color:#888;cursor:pointer;text-align:center;
outline:none;font-family:inherit;transition:all .1s}
.ac-btn:active{background:#1e1e1e;transform:translateY(1px)}
.ac-btn.sel{border-color:#ff6b35;color:#ff6b35;background:rgba(255,107,53,.08)}
.ac-row{display:flex;align-items:center;justify-content:space-between;padding:6px 0}
.ac-label{font-size:10px;color:#666;text-transform:uppercase;letter-spacing:.5px}
.ac-temp{font-size:22px;font-weight:700;color:#fff;font-family:Consolas,monospace}
.ac-temp-unit{font-size:11px;color:#555;margin-left:2px}
.temp-ctrl{display:flex;align-items:center;gap:8px}
.temp-btn{width:28px;height:28px;border:1px solid #2a2a2a;border-radius:2px;
background:#141414;color:#aaa;font-size:16px;cursor:pointer;outline:none;
display:flex;align-items:center;justify-content:center}
.temp-btn:active{background:#1e1e1e}
.ac-fan{display:flex;gap:4px;margin-top:10px}
.fan-dot{width:10px;height:10px;border:1px solid #2a2a2a;border-radius:1px;background:#141414}
.fan-dot.sel{border-color:#ff6b35;background:#ff6b35}
.tgl{width:40px;height:22px;border:1px solid #2a2a2a;border-radius:2px;background:#141414;
cursor:pointer;position:relative;outline:none;flex-shrink:0;
-webkit-appearance:none;appearance:none;transition:all .15s}
.tgl::after{content:'';position:absolute;top:2px;left:2px;
width:14px;height:14px;border-radius:1px;background:#555;transition:all .15s}
.tgl.on{background:#0f2a0f;border-color:#1f5a1f}
.tgl.on::after{left:22px;background:#3bca3b}

/* 弹窗遮罩 */
.modal-mask{display:none;position:fixed;top:0;left:0;right:0;bottom:0;
background:rgba(0,0,0,.75);z-index:999;align-items:center;justify-content:center;padding:20px}
.modal-mask.show{display:flex}
.modal{background:#1a1a1a;border:1px solid #2a2a2a;border-radius:4px;width:100%;max-width:380px;
max-height:90vh;overflow-y:auto;-webkit-overflow-scrolling:touch}
.modal-hd{display:flex;align-items:center;justify-content:space-between;
padding:10px 14px;border-bottom:1px solid #222;background:#1e1e1e}
.modal-hd .t{font-size:12px;font-weight:600;color:#ccc;letter-spacing:.5px}
.modal-close{background:none;border:none;color:#666;font-size:18px;cursor:pointer;
padding:0 4px;line-height:1;outline:none;font-family:inherit}
.modal-bd{padding:14px}

.wifi-list{border:1px solid #222;border-radius:2px;height:220px;overflow-y:auto;
-webkit-overflow-scrolling:touch;margin-bottom:10px;background:#111}
.wifi-item{padding:8px 10px;border-bottom:1px solid #1a1a1a;cursor:pointer;
display:flex;justify-content:space-between;align-items:center;font-size:12px;color:#999;
transition:background .1s}
.wifi-item:last-child{border-bottom:none}
.wifi-item:active{background:#1e1e1e}
.wifi-item.sel{background:#1e2a1e;color:#3bca3b}
.rssi{font-size:10px;color:#555;font-family:Consolas,monospace}
.wifi-hint{text-align:center;font-size:11px;color:#555;padding:18px 0;font-family:Consolas,monospace}

.inp-grp{margin-bottom:8px}
.inp-grp label{font-size:10px;color:#666;text-transform:uppercase;letter-spacing:.5px;display:block;margin-bottom:4px}
.inp-grp input{width:100%;padding:10px 12px;background:#111;border:1px solid #2a2a2a;
border-radius:2px;font-size:12px;color:#ccc;outline:none;font-family:inherit;
transition:border-color .15s}
.inp-grp input:focus{border-color:#ff6b35}
.inp-grp input::placeholder{color:#444}
.btn{display:block;width:100%;padding:10px;border:1px solid #2a2a2a;border-radius:2px;
font-size:11px;font-weight:600;text-align:center;cursor:pointer;outline:none;
font-family:inherit;background:#1e1e1e;color:#aaa;transition:all .1s;letter-spacing:.5px}
.btn:active{background:#141414;transform:translateY(1px)}
.btn-pri{background:#ff6b35;border-color:#d94f15;color:#fff}
.btn-pri:active{background:#d94f15}
.btn-pri:disabled{background:#3a3a3a;border-color:#2a2a2a;color:#555;cursor:not-allowed}
.btn-dng{background:#1e0f0f;border-color:#3a1a1a;color:#e53e3e;margin-top:6px}
.btn-dng:active{background:#140a0a}
.scan-row{display:flex;justify-content:space-between;align-items:center;margin-bottom:8px}
.scan-hint{font-size:10px;color:#555;font-family:Consolas,monospace}
.scan-btn{font-size:10px;color:#ff6b35;cursor:pointer;text-transform:uppercase;letter-spacing:.5px;
background:none;border:none;padding:0;outline:none;font-family:inherit}
.scan-btn:disabled{color:#444;cursor:not-allowed}

