Hebaiju/esp8266_opendoor/src/service/srv_web.cpp
.ft{text-align:center;font-size:9px;color:#333;margin-top:14px;font-family:Consolas,monospace;letter-spacing:.5px}

.step-hint{font-size:10px;color:#555;margin-bottom:10px;padding:6px 8px;
background:#111;border:1px solid #222;border-radius:2px;font-family:Consolas,monospace}
.cur-info{margin-bottom:10px;padding:10px 12px;background:#0f1a0f;
border:1px solid #1a3a1a;border-radius:2px}
.cur-label{font-size:9px;color:#3bca3b;text-transform:uppercase;letter-spacing:.5px;margin-bottom:4px}
.cur-val{font-size:13px;color:#fff;font-family:Consolas,monospace;word-break:break-all}
</style>
</head>
<body>
<div class="wrap">
  <div class="hdr">
    <h1>开门猫</h1>
    <div class="sub">OPEN-DOOR-CAT CONTROL TERMINAL v0.0.3</div>
  </div>
  <div class="card">
    <div class="card-hd"><span class="t">系统状态</span><span class="s" id="sysTime">--:--:--</span></div>
    <div class="card-bd">
      <div class="st-row" id="statusRow">
        <span class="st-tag" id="wifiTag" onclick="openWifiModal()"><span class="led"></span><span id="wifiTxt">WiFi</span></span>
        <span class="st-tag" id="blinkerTag" onclick="openBlinkerModal()"><span class="led"></span><span id="blinkTxt">点灯</span></span>
        <span class="st-tag" id="ntpTag"><span class="led"></span><span id="ntpTxt">NTP</span></span>
      </div>
      <div class="grid">
        <div class="cell" onclick="openWifiModal()"><div class="v" id="valRssi">--</div><div class="l">信号dBm</div></div>
        <div class="cell" onclick="openWifiModal()"><div class="v" id="valIp">---.---.---.---</div><div class="l">IP地址</div></div>
        <div class="cell highlight"><div class="v" id="valHeartbeat">#--</div><div class="l">心跳</div></div>
        <div class="cell"><div class="v" id="valWebReq">--</div><div class="l">Web请求</div></div>
      </div>
    </div>
  </div>
  <div class="card">
    <div class="card-hd"><span class="t">门控制</span></div>
    <div class="card-bd door-wrap">
      <button class="door-btn" id="doorBtn" onclick="openDoor()"><span class="ic">&#128682;</span></button>
      <div class="door-tx">点击开门</div>
      <div class="door-msg" id="doorMsg"></div>
      <div class="light-ctrl">
        <span class="ic">&#128161;</span>
        <button class="light-tgl" id="lightTgl" onclick="toggleLight()"></button>
      </div>
    </div>
  </div>
  <div class="card">
    <div class="collapse-hd open" id="acHd" onclick="toggleCollapse('ac')">
      <span class="l">空调控制</span>
      <span class="a">&#9660;</span>
    </div>
    <div class="collapse-bd open" id="acBd">
      <div class="collapse-in">
        <div class="ac-row">
          <span class="ac-label">电源</span>
          <button class="tgl" id="acPwr" onclick="toggleAcPower()"></button>
        </div>
        <div class="ac-ctrl">
          <button class="ac-btn" id="acCool" onclick="setAcMode('cool')">制冷</button>
          <button class="ac-btn" id="acDry" onclick="setAcMode('dry')">除湿</button>
          <button class="ac-btn" id="acHot" onclick="setAcMode('hot')">制热</button>
          <button class="ac-btn" id="acAuto" onclick="setAcMode('auto')">自动</button>
          <button class="ac-btn" id="acFan" onclick="setAcMode('fan')">送风</button>
        </div>
        <div class="ac-row">
          <span class="ac-label">温度</span>
          <div class="temp-ctrl">
            <button class="temp-btn" onclick="adjAcTemp(-1)">-</button>
            <span class="ac-temp"><span id="acTempVal">26</span><span class="ac-temp-unit">°C</span></span>
            <button class="temp-btn" onclick="adjAcTemp(1)">+</button>
          </div>
        </div>
        <div class="ac-fan" id="acFanLevel">
          <span class="fan-dot"></span><span class="fan-dot"></span><span class="fan-dot"></span><span class="fan-dot"></span><span class="fan-dot"></span>
        </div>
      </div>
    </div>
  </div>
  <div class="ft">ESP8266-01S | 1MB Flash</div>
</div>

<!-- WiFi配网弹窗 -->
<div class="modal-mask" id="wifiModal">
  <div class="modal">
    <div class="modal-hd">
      <span class="t">WiFi 配置</span>
      <button class="modal-close" onclick="closeWifiModal()">&times;</button>
    </div>
    <div class="modal-bd">
      <div class="cur-info" id="wifiCurInfo">
        <div class="cur-label">当前连接</div>
        <div class="cur-val" id="wifiCurSsid">--</div>
      </div>
      <div class="step-hint">点击扫描查找可用网络，或直接输入WiFi信息</div>
      <div class="scan-row">
        <span class="scan-hint">可用网络</span>
        <button class="scan-btn" id="scanBtn" onclick="scanWifi()">&#8635; 扫描</button>
      </div>
      <div class="wifi-list" id="wifiList"><div class="wifi-hint">点击上方扫描按钮搜索WiFi</div></div>
      <div class="inp-grp">
        <label>WiFi 名称</label>
        <input type="text" id="ssid" placeholder="SSID">
      </div>
      <div class="inp-grp">
        <label>WiFi 密码</label>
        <input type="password" id="pass" placeholder="留空表示无密码">
      </div>
      <button class="btn btn-pri" id="saveWifiBtn" onclick="saveWifi()">保存并连接</button>
      <button class="btn btn-dng" onclick="clearWifiConfig()">清除WiFi配置</button>
    </div>
  </div>
</div>

<!-- Blinker配置弹窗 -->
<div class="modal-mask" id="blinkerModal">
  <div class="modal">
    <div class="modal-hd">
      <span class="t">点灯科技 配置</span>
      <button class="modal-close" onclick="closeBlinkerModal()">&times;</button>
    </div>
    <div class="modal-bd">
      <div class="cur-info" id="blinkerCurInfo">
        <div class="cur-label">当前密钥</div>
        <div class="cur-val" id="blinkerCurAuth">--</div>
      </div>
      <div class="step-hint">请输入点灯科技APP中的设备密钥</div>
      <div class="inp-grp">
        <label>设备密钥 (Auth Key)</label>
        <input type="text" id="blinkerAuth" placeholder="请输入密钥" maxlength="32">
      </div>
      <button class="btn btn-pri" id="saveBlinkerBtn" onclick="saveBlinker()">保存并连接</button>
      <button class="btn btn-dng" onclick="clearBlinkerConfig()">清除点灯配置</button>
    </div>
  </div>
</div>

<script>
var _poll=null,_hb=0,_needWifiModal=false,_needBlinkerModal=false,_status=null;

function poll(){
  fetch('/api/status').then(function(r){return r.json()}).then(function(d){
    _status=d;
    /* WiFi状态标签 */
    var wt=document.getElementById('wifiTag');
    if(d.wifi){wt.className='st-tag ok';document.getElementById('wifiTxt').textContent='WiFi已连'}
    else{wt.className='st-tag err';document.getElementById('wifiTxt').textContent='WiFi断开'}

    /* Blinker状态标签 */
    var bt=document.getElementById('blinkerTag');
    if(!d.hasBlinkerConfig){bt.className='st-tag warn';document.getElementById('blinkTxt').textContent='点灯未配置'}
    else if(d.blinker){bt.className='st-tag ok';document.getElementById('blinkTxt').textContent='点灯已连'}
    else{bt.className='st-tag warn';document.getElementById('blinkTxt').textContent='点灯连接中'}

    /* NTP状态 */
    var nt=document.getElementById('ntpTag');
    if(d.ntp){nt.className='st-tag ok';document.getElementById('ntpTxt').textContent='NTP同步'}
    else{nt.className='st-tag';document.getElementById('ntpTxt').textContent='NTP未同步'}

    /* 系统数值 */
    document.getElementById('valRssi').textContent=d.rssi||'--';
    document.getElementById('valIp').textContent=d.ip||'---.---.---.---';
    document.getElementById('valWebReq').textContent=d.webReq||'0';

    /* 心跳 */
    if(d.heartbeat&&d.heartbeat!==_hb){_hb=d.heartbeat;document.getElementById('valHeartbeat').textContent='#'+_hb}
    if(d.time)document.getElementById('sysTime').textContent=d.time;

    /* 灯光 */
    var lt=document.getElementById('lightTgl');
    lt.className=d.light?'light-tgl on':'light-tgl';

    /* 门状态 */
    var db=document.getElementById('doorBtn'),dm=document.getElementById('doorMsg');
    if(d.opening){db.className='door-btn work';dm.textContent='开门中...';dm.className='door-msg ok'}
    else if(db.className.indexOf('work')>=0){db.className='door-btn';dm.textContent=''}

    /* 空调 */
    document.getElementById('acPwr').className=d.acPower?'tgl on':'tgl';
    document.getElementById('acTempVal').textContent=d.acTemp||'26';
    var m=d.acMode||'auto';
    ['cool','dry','hot','auto','fan'].forEach(function(x){
      var b=document.getElementById('ac'+x.charAt(0).toUpperCase()+x.slice(1));
      b.className=x===m?'ac-btn sel':'ac-btn';
    });
    var fl=parseInt(d.acFan)||1;
    var fd=document.getElementById('acFanLevel').querySelectorAll('.fan-dot');
    fd.forEach(function(el,i){el.className=i<fl?'fan-dot sel':'fan-dot'});

