Hebaiju/esp8266_opendoor/src/service/srv_web.cpp
    /* 首次加载时判断是否需要弹出配置弹窗 */
    if(_needWifiModal===false&&_needBlinkerModal===false){
      _needWifiModal=!d.wifi&&!d.hasWifiConfig;
      _needBlinkerModal=d.wifi&&!d.hasBlinkerConfig;
      if(_needWifiModal){openWifiModal()}
      else if(_needBlinkerModal){openBlinkerModal()}
    }
  }).catch(function(){})
}
poll();
_poll=setInterval(poll,2000);

/* ===== 门控制 ===== */
function openDoor(){
  var b=document.getElementById('doorBtn'),m=document.getElementById('doorMsg');
  if(b.className.indexOf('work')>=0)return;
  b.className='door-btn work';m.textContent='发送指令...';m.className='door-msg';
  fetch('/action_open').then(function(r){return r.text()}).then(function(){
    m.textContent='指令已执行';m.className='door-msg ok';
    setTimeout(function(){if(document.getElementById('doorBtn').className.indexOf('work')<0)m.textContent=''},4000);
  }).catch(function(){m.textContent='请求失败';m.className='door-msg fail';b.className='door-btn'})
}
function toggleLight(){
  fetch('/action_light').then(function(r){return r.text()}).then(function(){poll()}).catch(function(){})
}

/* ===== 折叠面板 ===== */
function toggleCollapse(id){
  var h=document.getElementById(id+'Hd'),b=document.getElementById(id+'Bd');
  if(h.className.indexOf('open')>=0){h.className='collapse-hd';b.className='collapse-bd'}
  else{h.className='collapse-hd open';b.className='collapse-bd open'}
}

/* ===== WiFi弹窗 ===== */
function openWifiModal(){
  document.getElementById('wifiModal').className='modal-mask show';
  _needWifiModal=false;
  // 显示当前配置
  var ssid=document.getElementById('wifiCurSsid');
  if(_status && _status.ssid){
    ssid.textContent=_status.ssid;
    document.getElementById('ssid').value=_status.ssid;
  } else {
    ssid.textContent='未配置';
  }
}
function closeWifiModal(){
  document.getElementById('wifiModal').className='modal-mask';
}
function selWifi(s){
  document.getElementById('ssid').value=s;
  document.querySelectorAll('.wifi-item').forEach(function(i){i.className='wifi-item'});
  if(event && event.target){
    var it=event.target.closest('.wifi-item');
    if(it)it.className='wifi-item sel';
  }
}
function scanWifi(){
  var e=document.getElementById('scanBtn'),l=document.getElementById('wifiList');
  e.disabled=true;e.textContent='扫描中...';
  l.innerHTML='<div class="wifi-hint">扫描中，请稍候...</div>';
  fetch('/api/scan').then(function(r){return r.json()}).then(function(d){
    if(!d||!d.length){l.innerHTML='<div class="wifi-hint">未发现WiFi信号</div>';e.disabled=false;e.textContent='&#8635; 重新扫描';return}
    var h='';for(var i=0;i<d.length;i++){
      var sf=d[i].s.replace(/'/g,"\\'");
      h+='<div class="wifi-item" onclick="selWifi(\''+sf+'\')"><span>'+d[i].s+'</span><span class="rssi">'+d[i].r+'dBm</span></div>';
    }
    l.innerHTML=h;e.disabled=false;e.textContent='&#8635; 重新扫描';
  }).catch(function(){l.innerHTML='<div class="wifi-hint">扫描失败</div>';e.disabled=false;e.textContent='&#8635; 重试'})
}
function saveWifi(){
  var s=document.getElementById('ssid').value;
  var p=document.getElementById('pass').value;
  if(!s){alert('请输入WiFi名称');return}
  var btn=document.getElementById('saveWifiBtn');
  btn.disabled=true;btn.textContent='保存中...';
  fetch('/save?ssid='+encodeURIComponent(s)+'&pass='+encodeURIComponent(p)).then(function(){
    document.body.innerHTML='<div style="text-align:center;padding:80px 20px;color:#888;font-family:Consolas,monospace;font-size:14px"><div style="color:#ff6b35;font-size:20px;margin-bottom:16px">配置已保存</div><div>设备重启中...</div></div>';
  }).catch(function(){location.reload()})
}
function clearWifiConfig(){
  if(!confirm('确定清除WiFi配置？设备将重启。'))return;
  fetch('/clear').then(function(){
    document.body.innerHTML='<div style="text-align:center;padding:80px 20px;color:#888;font-family:Consolas,monospace;font-size:14px"><div style="color:#e53e3e;font-size:20px;margin-bottom:16px">配置已清除</div><div>设备重启中...</div></div>';
  }).catch(function(){location.reload()})
}

/* ===== Blinker弹窗 ===== */
function openBlinkerModal(){
  document.getElementById('blinkerModal').className='modal-mask show';
  _needBlinkerModal=false;
  // 显示当前配置
  var authEl=document.getElementById('blinkerCurAuth');
  if(_status && _status.blinkerAuth){
    authEl.textContent=_status.blinkerAuth;
    document.getElementById('blinkerAuth').value=_status.blinkerAuth;
  } else {
    authEl.textContent='未配置';
  }
}
function closeBlinkerModal(){
  document.getElementById('blinkerModal').className='modal-mask';
}
function saveBlinker(){
  var k=document.getElementById('blinkerAuth').value.trim();
  if(!k){alert('请输入设备密钥');return}
  var btn=document.getElementById('saveBlinkerBtn');
  btn.disabled=true;btn.textContent='保存中...';
  fetch('/save_blinker?auth='+encodeURIComponent(k)).then(function(){
    document.body.innerHTML='<div style="text-align:center;padding:80px 20px;color:#888;font-family:Consolas,monospace;font-size:14px"><div style="color:#ff6b35;font-size:20px;margin-bottom:16px">配置已保存</div><div>设备重启中...</div></div>';
  }).catch(function(){location.reload()})
}
function clearBlinkerConfig(){
  if(!confirm('确定清除点灯科技配置？设备将重启。'))return;
  fetch('/clear_blinker').then(function(){
    document.body.innerHTML='<div style="text-align:center;padding:80px 20px;color:#888;font-family:Consolas,monospace;font-size:14px"><div style="color:#e53e3e;font-size:20px;margin-bottom:16px">配置已清除</div><div>设备重启中...</div></div>';
  }).catch(function(){location.reload()})
}

/* ===== 空调控制 ===== */
function toggleAcPower(){
  fetch('/action_ac_power').then(function(r){return r.text()}).then(function(){poll()}).catch(function(){})
}
function setAcMode(m){
  fetch('/action_ac_mode?m='+m).then(function(r){return r.text()}).then(function(){poll()}).catch(function(){})
}
function adjAcTemp(d){
  var cur=parseInt(document.getElementById('acTempVal').textContent)||26;
  var nv=cur+d;if(nv<16||nv>30)return;
  fetch('/action_ac_temp?t='+nv).then(function(r){return r.text()}).then(function(){poll()}).catch(function(){})
}
</script>
</body>
</html>
)rawliteral";

/* ===== API处理函数 ===== */

