Hebaiju/esp8266_opendoor/src/service/srv_web.cpp
static void handle_root(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /");

    s_server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    s_server.send(200, "text/html; charset=utf-8", "");
    s_server.sendContent_P(AP_PANEL_HTML);
}

static void handle_api_status(void)
{
    s_request_count++;

    String json = "{";
    /* WiFi状态 */
    json += "\"wifi\":" + String(srv_wifi_is_connected() ? "true" : "false");
    json += ",\"rssi\":\"" + String(srv_wifi_get_rssi()) + "\"";
    json += ",\"ip\":\"" + String(srv_wifi_get_ip()) + "\"";
    json += ",\"ssid\":\"" + String(srv_wifi_get_ssid()) + "\"";
    json += ",\"hasWifiConfig\":" + String(srv_wifi_has_config() ? "true" : "false");
    /* 点灯状态 */
    json += ",\"blinker\":" + String(srv_blinker_is_ready() ? "true" : "false");
    json += ",\"blinkerAuth\":\"" + String(srv_blinker_get_auth()) + "\"";
    json += ",\"hasBlinkerConfig\":" + String(srv_blinker_has_config() ? "true" : "false");
    /* NTP状态 */
    json += ",\"ntp\":" + String(srv_ntp_is_synced() ? "true" : "false");
    /* 系统时间 */
    struct tm t;
    if (srv_ntp_get_time(&t)) {
        char time_str[32];
        snprintf(time_str, sizeof(time_str), "%02d:%02d:%02d", t.tm_hour, t.tm_min, t.tm_sec);
        json += ",\"time\":\"" + String(time_str) + "\"";
    }
    /* 心跳计数 */
    json += ",\"heartbeat\":" + String(task_uart_get_heartbeat_count());
    /* Web请求计数 */
    json += ",\"webReq\":" + String(s_request_count);
    /* 灯光状态 */
    json += ",\"light\":" + String(drv_led_get_brightness() > 0 ? "true" : "false");
    /* 门状态 */
    json += ",\"opening\":" + String(task_door_is_opening() ? "true" : "false");
    /* 空调状态 */
    json += ",\"acPower\":" + String(srv_ir_ac_get_power() ? "true" : "false");
    json += ",\"acTemp\":" + String(srv_ir_ac_get_temp());
    const char *mode_en = "auto";
    switch (srv_ir_ac_get_mode()) {
        case AC_MODE_COOL: mode_en = "cool"; break;
        case AC_MODE_DRY:  mode_en = "dry"; break;
        case AC_MODE_HEAT: mode_en = "hot"; break;
        case AC_MODE_AUTO: mode_en = "auto"; break;
        case AC_MODE_FAN:  mode_en = "fan"; break;
    }
    json += ",\"acMode\":\"" + String(mode_en) + "\"";
    json += ",\"acFan\":\"" + String(srv_ir_ac_get_fan_level()) + "\"";
    json += "}";

    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "application/json; charset=utf-8", json);
}

static void handle_api_scan(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /api/scan (WiFi扫描)");
    srv_wifi_scan_start();
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "application/json; charset=utf-8", srv_wifi_get_scan_cache());
}

static void handle_action_open(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /action_open (开门)");
    door_send_cmd(DOOR_CMD_OPEN);
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "开门指令已执行");
}

static void handle_action_light(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /action_light (切换灯光)");
    task_led_manual_toggle();
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "灯光已切换");
}

static void handle_action_ac_power(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /action_ac_power (空调电源)");
    bool current = srv_ir_ac_get_power();
    srv_ir_ac_set_power(!current);
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", current ? "空调已关闭" : "空调已开启");
}

static void handle_action_ac_mode(void)
{
    s_request_count++;
    String m = s_server.arg("m");
    LOG_I("Web请求: GET /action_ac_mode?m=%s", m.c_str());

    ac_mode_t mode = AC_MODE_AUTO;
    if (m == "cool") mode = AC_MODE_COOL;
    else if (m == "dry") mode = AC_MODE_DRY;
    else if (m == "hot") mode = AC_MODE_HEAT;
    else if (m == "fan") mode = AC_MODE_FAN;
    else mode = AC_MODE_AUTO;

    srv_ir_ac_set_mode(mode);
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "模式已切换");
}

static void handle_action_ac_temp(void)
{
    s_request_count++;
    int t = s_server.arg("t").toInt();
    LOG_I("Web请求: GET /action_ac_temp?t=%d", t);
    if (t >= 16 && t <= 30) {
        srv_ir_ac_set_temp(t);
        s_server.sendHeader("Access-Control-Allow-Origin", "*");
        s_server.send(200, "text/plain; charset=utf-8", "温度已设置");
    } else {
        s_server.sendHeader("Access-Control-Allow-Origin", "*");
        s_server.send(400, "text/plain; charset=utf-8", "温度无效");
    }
}

static void handle_save(void)
{
    s_request_count++;
    String ssid = s_server.arg("ssid");
    String pass = s_server.arg("pass");
    LOG_I("Web请求: GET /save SSID=%s", ssid.c_str());

    if (ssid.length() == 0 || ssid.length() >= 32) {
        s_server.send(400, "text/plain", "SSID无效");
        return;
    }

    wifi_config_t cfg;
    memset(&cfg, 0, sizeof(cfg));
    strncpy(cfg.ssid, ssid.c_str(), sizeof(cfg.ssid) - 1);
    strncpy(cfg.pass, pass.c_str(), sizeof(cfg.pass) - 1);
    cfg.magic = EEPROM_WIFI_MAGIC;

    srv_wifi_save_config(&cfg);
    LOG_I("WiFi配置已保存: %s", cfg.ssid);

    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "OK");
    delay(300);
    ESP.restart();
}

static void handle_clear(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /clear (清除WiFi配置)");
    srv_wifi_clear_config();
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "OK");
    delay(300);
    ESP.restart();
}

static void handle_save_blinker(void)
{
    s_request_count++;
    String auth = s_server.arg("auth");
    LOG_I("Web请求: GET /save_blinker (保存点灯配置)");

    if (auth.length() == 0 || auth.length() > EEPROM_BLINKER_AUTH_MAX) {
        s_server.send(400, "text/plain", "密钥无效");
        return;
    }

    srv_blinker_save_config(auth.c_str());

    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "OK");
    delay(300);
    ESP.restart();
}

static void handle_clear_blinker(void)
{
    s_request_count++;
    LOG_I("Web请求: GET /clear_blinker (清除点灯配置)");
    srv_blinker_clear_config();
    s_server.sendHeader("Access-Control-Allow-Origin", "*");
    s_server.send(200, "text/plain; charset=utf-8", "OK");
    delay(300);
    ESP.restart();
}

static void handle_not_found(void)
{
    s_request_count++;
    String uri = s_server.uri();
    String method = (s_server.method() == HTTP_GET) ? "GET" : "POST";
    LOG_I("Web请求: %s %s (404)", method.c_str(), uri.c_str());

    if (s_server.method() == HTTP_GET) {
        s_server.sendHeader("Location", "http://" + WiFi.softAPIP().toString() + "/");
        s_server.send(302, "text/plain", "");
    } else {
        s_server.send(404, "text/plain", "Not Found");
    }
}

/* ===== 公共接口 ===== */

err_code_t srv_web_init(void)
{
    s_server.on("/", HTTP_GET, handle_root);
    s_server.on("/api/status", HTTP_GET, handle_api_status);
    s_server.on("/api/scan", HTTP_GET, handle_api_scan);
    s_server.on("/action_open", HTTP_GET, handle_action_open);
    s_server.on("/action_light", HTTP_GET, handle_action_light);
    s_server.on("/action_ac_power", HTTP_GET, handle_action_ac_power);
    s_server.on("/action_ac_mode", HTTP_GET, handle_action_ac_mode);
    s_server.on("/action_ac_temp", HTTP_GET, handle_action_ac_temp);
    s_server.on("/save", HTTP_GET, handle_save);
    s_server.on("/clear", HTTP_GET, handle_clear);
    s_server.on("/save_blinker", HTTP_GET, handle_save_blinker);
    s_server.on("/clear_blinker", HTTP_GET, handle_clear_blinker);
    s_server.onNotFound(handle_not_found);

    s_server.begin();
    s_dns_server.setErrorReplyCode(DNSReplyCode::NoError);
    s_dns_server.start(53, "*", WiFi.softAPIP());

    s_web_started = true;
    LOG_I("Web服务器已启动, 端口80, DNS劫持已启用");
    return APP_OK;
}

void srv_web_run(void)
{
    if (s_web_started) {
        s_server.handleClient();
        s_dns_server.processNextRequest();
    }
}

uint32_t srv_web_get_request_count(void)
{
    return s_request_count;
}
